In [ ]:
"""
Native Accessors:
    df.column / df["column"][3]

    example1:
        df.name
    example2:
        df["name"]
        df["name"][1]


Pandas Accessors:
    pd.iloc(["row", "columns"])

    example:
        df.iloc[0] #first-row selection


        
        df.iloc[:,0] #first-column selection
        df.iloc[:3, 0] #to select only three rows in 0th columns
        df.iloc[:3, :2] #to select three rows in 2 columns
        df.iloc[[0,3], 0] #to select 0th and 4th index item of column 0
        df.iloc[[0,3], [0, 2, 1]] #to select 0th and 4th index item of column 0, 2, 1
"""

In [25]:
import pandas as pd

df = pd.read_csv("friends.csv")
df

      name        city  marks
0    Harry      Rampur   92.0
1    Rohan     Kolkata   34.0
2   Skillf    Bareilly   24.0
3    Shubh  Antarctica   17.0
4    Harry      Ranchi   93.0
5     Amit     Kolkata   15.0
6    Ahmed       Delhi   14.0
7  Raheman      Mumbai   34.0
8    Hafiz       Delhi    NaN

In [26]:
# df = pd.read_csv("friends.csv", index_col=0) #to remove index columns
# df

In [27]:
"""Native Accessors"""
"""example1"""
df.name

0      Harry
1      Rohan
2     Skillf
3      Shubh
4      Harry
5       Amit
6      Ahmed
7    Raheman
8      Hafiz
Name: name, dtype: object

In [28]:
"""example2"""
df["name"]

0      Harry
1      Rohan
2     Skillf
3      Shubh
4      Harry
5       Amit
6      Ahmed
7    Raheman
8      Hafiz
Name: name, dtype: object

In [29]:
df["name"][1]

'Rohan'

In [30]:
"""Pandas Accessors (.iloc = index-selection)"""
df

      name        city  marks
0    Harry      Rampur   92.0
1    Rohan     Kolkata   34.0
2   Skillf    Bareilly   24.0
3    Shubh  Antarctica   17.0
4    Harry      Ranchi   93.0
5     Amit     Kolkata   15.0
6    Ahmed       Delhi   14.0
7  Raheman      Mumbai   34.0
8    Hafiz       Delhi    NaN

In [31]:
df.iloc[0] #first-row selection

name      Harry
city     Rampur
marks      92.0
Name: 0, dtype: object

In [32]:
df.iloc[:,0] #first-column selection

0      Harry
1      Rohan
2     Skillf
3      Shubh
4      Harry
5       Amit
6      Ahmed
7    Raheman
8      Hafiz
Name: name, dtype: object

In [33]:
df.iloc[:3, 0] #to select only three rows in 0th columns

0     Harry
1     Rohan
2    Skillf
Name: name, dtype: object

In [34]:
df.iloc[:3, :2] #to select three rows in 2 columns

     name      city
0   Harry    Rampur
1   Rohan   Kolkata
2  Skillf  Bareilly

In [35]:
df.iloc[[0,3], 0] #to select 0th and 4th index item of column 0

0    Harry
3    Shubh
Name: name, dtype: object

In [36]:
df.iloc[[0,3], [0, 2, 1]] #to select 0th and 4th index item of column 0, 2, 1

    name  marks        city
0  Harry   92.0      Rampur
3  Shubh   17.0  Antarctica

In [37]:
""".loc = index-selection"""
df

      name        city  marks
0    Harry      Rampur   92.0
1    Rohan     Kolkata   34.0
2   Skillf    Bareilly   24.0
3    Shubh  Antarctica   17.0
4    Harry      Ranchi   93.0
5     Amit     Kolkata   15.0
6    Ahmed       Delhi   14.0
7  Raheman      Mumbai   34.0
8    Hafiz       Delhi    NaN

In [38]:
df.loc[1] #select 0th row

name       Rohan
city     Kolkata
marks       34.0
Name: 1, dtype: object

In [39]:
df.loc[:,"name"]

0      Harry
1      Rohan
2     Skillf
3      Shubh
4      Harry
5       Amit
6      Ahmed
7    Raheman
8      Hafiz
Name: name, dtype: object

In [40]:
df.loc[5,"name"]

'Amit'

In [41]:
df.loc[[0, 3, 6],"name"]

0    Harry
3    Shubh
6    Ahmed
Name: name, dtype: object

In [42]:
"""example1"""
df.city == "Kolkata" #to search matching value

0    False
1     True
2    False
3    False
4    False
5     True
6    False
7    False
8    False
Name: city, dtype: bool

In [43]:
"""example2"""
df.loc[df.city == "Kolkata"]

    name     city  marks
1  Rohan  Kolkata   34.0
5   Amit  Kolkata   15.0

In [44]:
df.loc[(df.name == "Kolkata") & (df.marks >= 34)] #not working

Empty DataFrame
Columns: [name, city, marks]
Index: []

In [45]:
df.loc[(df.name == "Kolkata") | (df.marks >= 34)] #not working

      name     city  marks
0    Harry   Rampur   92.0
1    Rohan  Kolkata   34.0
4    Harry   Ranchi   93.0
7  Raheman   Mumbai   34.0

In [46]:
df.loc[df.city.isin(["Rampur", "Ranchi", "Kolkata"])]

    name     city  marks
0  Harry   Rampur   92.0
1  Rohan  Kolkata   34.0
4  Harry   Ranchi   93.0
5   Amit  Kolkata   15.0

In [47]:
df.loc[df.marks.notnull()]

      name        city  marks
0    Harry      Rampur   92.0
1    Rohan     Kolkata   34.0
2   Skillf    Bareilly   24.0
3    Shubh  Antarctica   17.0
4    Harry      Ranchi   93.0
5     Amit     Kolkata   15.0
6    Ahmed       Delhi   14.0
7  Raheman      Mumbai   34.0